Autodesk.Revit.DB.Analysis.SpatialFieldManager.IsTextTypeIdValid(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document)
Verify if text type id is valid.
textTypeId:
Text type id to be validated.
doc:
Document for which %textTypeId% is validated.
Returns:
True if text type id is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetRegisteredResults
Returns an array of indices of all registered results
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.SetResultSchema(System.Int32,Autodesk.Revit.DB.Analysis.AnalysisResultSchema)
Sets a new value for an existing result schema in the result registry
idx:
Index of registered result schema
resultSchema:
Result schema replacing the existent one
Throws Autodesk.Revit.Exceptions.ArgumentException:
idx refers to non-existent result schema
-or-
name of resultSchema is not unique in view
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetResultSchema(System.Int32)
Returns result schema by index
idx:
Index of registered result schema
Throws Autodesk.Revit.Exceptions.ArgumentException:
idx refers to non-existent result schema
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.RegisterResult(Autodesk.Revit.DB.Analysis.AnalysisResultSchema)
Registers result and assigns it a unique result index
resultSchema:
Result schema to be registered
Returns:
Unique index assigned to the result
Throws Autodesk.Revit.Exceptions.ArgumentException:
name of resultSchema is not unique in view
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.IsResultSchemaNameUnique(System.String,System.Int32)
Verify the uniqueness of the name among all registered result schemas.
name:
Name to verify uniqueness of.
resultIndexToSkip:
Index of result (e.g. to be replaced) which names should not count for uniqueness; negative number means nothing is excluded from comparison.
Returns:
True if name is unique, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.SetMeasurementDescriptions(System.Collections.Generic.IList{System.String})
Sets Descriptions for all measurements
measurementDescriptions:
Array of measurement descriptions.
The lengths of the array must be equal to the number of measurements set during creation of SpatialFieldManager.
Throws Autodesk.Revit.Exceptions.ArgumentException:
measurementDescriptions lengths is not equal to the number of measurements set during creation of SpatialFieldManager
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.SetMeasurementNames(System.Collections.Generic.IList{System.String})
Sets Names for all measurements
measurementNames:
Array of measurement names. All names in the array must be unique.
The lengths of the array must be equal to the number of measurements set during creation of SpatialFieldManager.
Throws Autodesk.Revit.Exceptions.ArgumentException:
measurementNames contains duplicate names or its lengths is not equal to the number of measurements set during creation of SpatialFieldManager
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetMaximum(System.Int32,System.Boolean)
Calculates the maximum value for all primitives
resultIndex:
Index of result schema
rawValue:
If true returned value is NOT multiplied by the current result's units multiplier, otherwise it IS
Returns:
Resulting maximum value
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
Thrown when current measurement is >= the number of measurements for at least one primitive
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetMinimum(System.Int32,System.Boolean)
Calculates the minimum value for all primitives
resultIndex:
Index of result schema
rawValue:
If true returned value is NOT multiplied by the current result's units multiplier, otherwise it IS
Returns:
Resulting minimum value
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
Thrown when current measurement is >= the number of measurements for at least one primitive
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetLegend
Returns legend element or NULL
Returns:
The legend element or NULL
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.Clear
Clear all analysis results managed by this manager object
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.UpdateSpatialFieldPrimitive(System.Int32,Autodesk.Revit.DB.Analysis.FieldDomainPoints,Autodesk.Revit.DB.Analysis.FieldValues,System.Int32)
Populates analysis results data (or replaces the existing data) in the existing primitive identified by the unique index
idx:
Unique index identifying the primitive
fieldDomainPoints:
Set of domain points.
If the new set of domain points is supplied, all previously supplied domain points and field values for all results are removed from the primitive.
If %fieldDomainPoints% is null only fieldValues are updated
fieldValues:
Set of data values.
Number of values in fieldValues must coincide with the number of points in fieldDomainPoints
resultIndex:
Unique index identifying the result schema
Throws Autodesk.Revit.Exceptions.ArgumentException:
idx refers to non-existent primitive
-or-
fieldValues has incorrect number of measurements in ValueAtPoint objects
-or-
fieldDomainPoints has inconsistent type
-or-
resultIndex refers to non-existent result schema
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
fieldDomainPoints and fieldValues have inconsistent number of points
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.RemoveSpatialFieldPrimitive(System.Int32)
Removes analysis results primitive identified by the unique index
idx:
Unique index identifying the primitive
Throws Autodesk.Revit.Exceptions.ArgumentException:
idx refers to non-existent primitive
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.AddSpatialFieldPrimitive(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.Transform)
Creates empty analysis results primitive associated with a curve and a transform.
curve:
Curve to be associated with the primitive.
%curve% does NOT correspond to actual Revit geometry, i.e. it cannot be associated with reference;
otherwise the other overload of the method must be used (taking "reference" as the input)
trf:
Conformal Transform to be applied to %curve%.
Returns:
Unique index of primitive for future references
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve points to a helical curve and is not supported for this operation.
-or-
Argument trf is not a conformal transform (see property Revit::DB::Transform::IsConformal)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.AddSpatialFieldPrimitive(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.Transform)
Creates empty analysis results primitive associated with a face and a transform.
Remarks:
This method accepts a reference to a model face, and a transform to be applied to
that face, allowing the display of analytical results on faces which are not
strictly a part of the Revit model.
This method should not be used if the transform is the identity transform,
i.e. the intent is to display results on a face which is part of the Revit model.
In that case, use the overload of this method which accepts
a reference.
If the input face is from the geometry of a symbol, the face will be considered to be
in the location specified by its symbol geometry. If your intention is to transform the face
relative to its location in the instance, your input transform must consist of the instance's
transform left multiplied by the extra transform to get the results you expect.
face:
Face to be associated with the primitive
trf:
Conformal Transform to be applied to %face%
Returns:
Unique index of primitive for future references
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
trf is not conformal.
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.AddSpatialFieldPrimitive(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode)
Creates an empty analysis results primitive associated with a reference, with the option to control how the reference element is hidden.
Remarks:
There can be multiple primitives associated with one reference, normally they would be shown with different results.
However this is justified only if they have different sets of domain points.
Otherwise one primitive can be used to display values for different results.
reference:
Reference pointing to the curve or face to be associated with the primitive
hidingMode:
The mode used to hide the original model element
Returns:
Unique index of primitive for future references
Throws Autodesk.Revit.Exceptions.ArgumentException:
reference points to neither face nor curve
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Analysis.SpatialFieldManager.AddSpatialFieldPrimitive(Autodesk.Revit.DB.Reference)
Creates an empty analysis results primitive associated with a reference.
Remarks:
There can be multiple primitives associated with one reference, normally they would be shown with different results.
However this is justified only if they have different sets of domain points.
Otherwise one primitive can be used to display values for different results.
reference:
Reference pointing to the curve or face to be associated with the primitive
Returns:
Unique index of primitive for future references
Throws Autodesk.Revit.Exceptions.ArgumentException:
reference points to neither face nor curve
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.AddSpatialFieldPrimitive
Creates empty analysis results primitive not associated with any geometry element
Returns:
Unique index of primitive for future references
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetSpatialFieldManager(Autodesk.Revit.DB.View)
Retrieves manager object for the given view or returns NULL
view:
View for which manager object is retrieved
Returns:
Manager object for the view passed in the argument
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.CreateSpatialFieldManager(Autodesk.Revit.DB.View,System.Int32)
Factory method - creates manager object for the given view
view:
View for which manager object is created or retrieved
numberOfMeasurements:
Total number of measurements in the calculated results.
This number defines the length of value arrays in ValueAtPoint objects
Returns:
Manager object for the view passed in the argument
Throws Autodesk.Revit.Exceptions.ArgumentException:
numberOfMeasurements is less than one
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is not allowed to display analysis results or a manager object for this view already exists
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.LegendShowDescription
If true legend contains analysis description.
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.LegendShowConfigurationName
If true legend contains analysis configuration name.
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.LegendTextTypeId
Stores element id of text associated with common (result-independent) part of legend in view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.ResultsVisibleInView
Enables analysis results visibility in the view.
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.UseRangeForAllMeasurements
Governs how minimum and maximum values (the data range) are calculated.
Remarks:
If true the data range is calculated from all measurements.
Otherwise the data range is calculated from the current measurement only.
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.CurrentMeasurement
Stores the currently displayed measurement
Remarks:
Must be in the range from 0 to (numberOfMeasurements - 1)
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: measurement is not in the range from 0 to (number of measurements - 1)
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager.LegendPosition
Stores current position of analysis results legend element in view
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.NumberOfMeasurements
Stores the total number of measurements
Remarks:
This number defines the length of value arrays in ValueAtPoint objects
Since:
2011

Autodesk.Revit.DB.Analysis.SpatialFieldManager
Exposes all API for an external analysis application.
Its primary role is creation, deletion and modification of SpatialFieldElement elements.
Since:
2011